src/DocumentJournals/ДокументыПоЗапасам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DocumentJournal>
		<Properties>
			<Name>ДокументыПоЗапасам</Name>
			<RegisteredDocuments>
				<xr:Item>Document.ПеремещениеЗапасов</xr:Item>
				<xr:Item>Document.ПриходнаяНакладная</xr:Item>
				<xr:Item>Document.РасходнаяНакладная</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Организация</Name>
					<References>
						<xr:Item>Document.ПеремещениеЗапасов.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПриходнаяНакладная.Attribute.Организация</xr:Item>
						<xr:Item>Document.РасходнаяНакладная.Attribute.Организация</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ВидОперации</Name>
					<References>
						<xr:Item>Document.ПеремещениеЗапасов.Attribute.ВидОперации</xr:Item>
						<xr:Item>Document.ПриходнаяНакладная.Attribute.ВидОперации</xr:Item>
						<xr:Item>Document.РасходнаяНакладная.Attribute.ВидОперации</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Склад</Name>
					<References>
						<xr:Item>Document.ПеремещениеЗапасов.Attribute.СтруктурнаяЕдиница</xr:Item>
						<xr:Item>Document.ПриходнаяНакладная.Attribute.СтруктурнаяЕдиница</xr:Item>
						<xr:Item>Document.РасходнаяНакладная.Attribute.СтруктурнаяЕдиница</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Ячейка</Name>
					<References>
						<xr:Item>Document.ПеремещениеЗапасов.Attribute.Ячейка</xr:Item>
						<xr:Item>Document.ПриходнаяНакладная.Attribute.Ячейка</xr:Item>
						<xr:Item>Document.РасходнаяНакладная.Attribute.Ячейка</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>СкладПолучатель</Name>
					<References>
						<xr:Item>Document.ПеремещениеЗапасов.Attribute.СтруктурнаяЕдиницаПолучатель</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ЯчейкаПолучатель</Name>
					<References>
						<xr:Item>Document.ПеремещениеЗапасов.Attribute.ЯчейкаПолучатель</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Комментарий</Name>
					<References>
						<xr:Item>Document.ПеремещениеЗапасов.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПриходнаяНакладная.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.РасходнаяНакладная.Attribute.Комментарий</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Автор</Name>
					<References>
						<xr:Item>Document.ПеремещениеЗапасов.Attribute.Автор</xr:Item>
						<xr:Item>Document.ПриходнаяНакладная.Attribute.Автор</xr:Item>
						<xr:Item>Document.РасходнаяНакладная.Attribute.Автор</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

src/Enums/ВидыОперацийПеремещениеЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПеремещениеЗапасов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеНаРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВЭксплуатацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзЭксплуатации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DocumentJournals/ДокументыПоЗапасам/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере формы
// 
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДинамическиеСпискиУНФ.ОтображатьТолькоВремяДляТекущейДаты(Список);
	
	//УНФ.ОтборыСписка
	УстановитьВидимостьОтборов();
	РаботаСОтборами.ОпределитьПорядокПредопределенныхОтборов(ЭтотОбъект);
	ЗаполнитьВидыОпераций();
	Если Параметры.Свойство("ЭтоНачальнаяСтраница") Тогда
		РаботаСОтборами.ВосстановитьНастройкиОтборов(ЭтотОбъект, Список);
		ЭтоНачальнаяСтраница = Ложь;
	Иначе
		ЭтоНачальнаяСтраница = Истина;
		РаботаСОтборами.СвернутьРазвернутьОтборыНаСервере(ЭтотОбъект, Ложь);
		ПредставлениеПериода = РаботаСОтборамиКлиентСервер.ОбновитьПредставлениеПериода(Неопределено);
	КонецЕсли;
	//Конец УНФ.ОтборыСписка
	
	//МобильныйКлиент
	АдаптироватьИнтерфейсПодМобильныйКлиент();
	//Конец МобильныйКлиент
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидыОпераций()
	
	СписокОпераций = ДеревоВидовОпераций.ПолучитьЭлементы().Добавить();
	СписокОпераций.ВидОперации = "Приходная накладная";
	Для каждого ВидОперации Из Метаданные.Перечисления.ВидыОперацийПриходнаяНакладная.ЗначенияПеречисления Цикл
		НоваяОперация = СписокОпераций.ПолучитьЭлементы().Добавить();
		НоваяОперация.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная[ВидОперации.Имя];
	КонецЦикла;
	
	СписокОпераций = ДеревоВидовОпераций.ПолучитьЭлементы().Добавить();
	СписокОпераций.ВидОперации = "Расходная накладная";
	Для каждого ВидОперации Из Метаданные.Перечисления.ВидыОперацийРасходнаяНакладная.ЗначенияПеречисления Цикл
		НоваяОперация = СписокОпераций.ПолучитьЭлементы().Добавить();
		НоваяОперация.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная[ВидОперации.Имя];
	КонецЦикла;
	
	СписокОпераций = ДеревоВидовОпераций.ПолучитьЭлементы().Добавить();
	СписокОпераций.ВидОперации = "Перемещение запасов";
	Для каждого ВидОперации Из Метаданные.Перечисления.ВидыОперацийПеремещениеЗапасов.ЗначенияПеречисления Цикл
		НоваяОперация = СписокОпераций.ПолучитьЭлементы().Добавить();
		НоваяОперация.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов[ВидОперации.Имя];
	КонецЦикла;
	
	ДеревоОпераций = РеквизитФормыВЗначение("ДеревоВидовОпераций");
	РаботаСФормойДокумента.УдалитьНедоступныеВидыОперацийДокументов(ДеревоОпераций);
	ЗначениеВРеквизитФормы(ДеревоОпераций, "ДеревоВидовОпераций");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ЗавершениеРаботы Тогда
		//УНФ.ОтборыСписка
		СохранитьНастройкиОтборов();
		//Конец УНФ.ОтборыСписка
	КонецЕсли; 

КонецПроцедуры

// Процедура - обработчик события формы "ПриЗагрузкеДанныхИзНастроекНаСервере".
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ОтборТипПриходныеНакладные = Настройки.Получить("ОтборТипПриходныеНакладные");
	ОтборТипРасходныеНакладные = Настройки.Получить("ОтборТипРасходныеНакладные");
	ОтборТипПеремещения	= Настройки.Получить("ОтборТипПеремещения");
	
	УстановитьОтборПоТипуДокумента();
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
// Процедура - обработчик события ПриИзменении реквизита ТипДокумента.
// 
Процедура ТипДокументаПриИзменении(Элемент)
	
	УстановитьОтборПоТипуДокумента();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоТипуДокумента()
	
	МассивОтбора = Новый Массив;
	Если ОтборТипПриходныеНакладные Тогда
		МассивОтбора.Добавить(Тип("ДокументСсылка.ПриходнаяНакладная"));
	КонецЕсли;
	Если ОтборТипРасходныеНакладные Тогда
		МассивОтбора.Добавить(Тип("ДокументСсылка.РасходнаяНакладная"));
	КонецЕсли;
	Если ОтборТипПеремещения Тогда
		МассивОтбора.Добавить(Тип("ДокументСсылка.ПеремещениеЗапасов"));
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Тип", МассивОтбора, , ,
		ЗначениеЗаполнено(МассивОтбора));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСкладОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("СтруктурнаяЕдиница", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОперацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("ВидОперации", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМеткуИОтборСписка("Организация", Элемент.Родитель.Имя, ВыбранноеЗначение);
	ВыбранноеЗначение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Параметр) Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	
	СтруктураПараметров = Новый Структура();
	РаботаСФормойДокументаКлиент.ДобавитьПоследнееЗначениеОтбораПоля(ДанныеМеток, СтруктураПараметров, "СтруктурнаяЕдиница");
	РаботаСФормойДокументаКлиент.ДобавитьПоследнееЗначениеОтбораПоля(ДанныеМеток, СтруктураПараметров, "ВидОперации");
	РаботаСФормойДокументаКлиент.ДобавитьПоследнееЗначениеОтбораПоля(ДанныеМеток, СтруктураПараметров, "Организация");
		
	ИмяФормыСтрока = РаботаСФормойДокументаКлиент.ИмяДокументаПоТипу(Параметр);
	ОткрытьФорму("Документ."+ИмяФормыСтрока+".ФормаОбъекта", Новый Структура("ЗначенияЗаполнения",СтруктураПараметров));

КонецПроцедуры

&НаКлиенте
Процедура ОтборОперацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыВыбора = Новый Структура("ДеревоВидовОпераций", ДеревоВидовОпераций);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбораВидаОперацииЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборВидаОперации", ПараметрыВыбора, ЭтотОбъект,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбораВидаОперацииЗавершение(Результат, ДополнительныеПараметры) Экспорт

	ОтборОперацияОбработкаВыбора(Элементы.ОтборОперация, Результат, Ложь);

КонецПроцедуры

#КонецОбласти

#Область Отборы

&НаСервере
Процедура УстановитьМеткуИОтборСписка(ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение,
	ПредставлениеЗначения = "")
	
	Если ПредставлениеЗначения="" Тогда
		ПредставлениеЗначения=Строка(ВыбранноеЗначение);
	КонецЕсли; 
	
	РаботаСОтборами.ПрикрепитьМеткуОтбора(ЭтотОбъект, ИмяПоляОтбораСписка, ГруппаРодительМетки, ВыбранноеЗначение,
		ПредставлениеЗначения);
	РаботаСОтборами.УстановитьОтборСписка(ЭтотОбъект, Список, ИмяПоляОтбораСписка);
	
КонецПроцедуры

//@skip-warning
&НаКлиенте
Процедура Подключаемый_МеткаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки,
	СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	МеткаИД = Сред(Элемент.Имя, СтрДлина("Метка_") + 1);
	УдалитьМеткуОтбора(МеткаИД);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьМеткуОтбора(МеткаИД)
	
	РаботаСОтборами.УдалитьМеткуОтбораСервер(ЭтотОбъект, Список, МеткаИД);

КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РаботаСОтборамиКлиент.ПредставлениеПериодаВыбратьПериод(ЭтотОбъект, "Список", "Дата");
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиОтборов()
	
	Если НЕ ЭтоНачальнаяСтраница Тогда
		РаботаСОтборами.СохранитьНастройкиОтборов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьРазвернутьПанельОтборов(Элемент)
	
	НовоеЗначениеВидимость = НЕ Элементы.ФильтрыНастройкиИДопИнфо.Видимость;
	РаботаСОтборамиКлиент.СвернутьРазвернутьПанельОтборов(ЭтотОбъект, НовоеЗначениеВидимость);
		
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОтборы(Команда)
	
	ИмяРеквизитаСписка = "Список";
	ИмяТЧДанныеМеток = "ДанныеМеток";
	ИмяТЧДанныеОтборов = "ДанныеОтборов";
	ИмяГруппыОтборов = "ГруппаОтборы";
	ИмяПредопределенныеОтборыПоУмолчанию = "ПредопределенныеОтборыПоУмолчанию";
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяРеквизитаСписка", ИмяРеквизитаСписка);
	ДополнительныеПараметры.Вставить("ИмяТЧДанныеМеток", ИмяТЧДанныеМеток);
	ДополнительныеПараметры.Вставить("ИмяТЧДанныеОтборов", ИмяТЧДанныеОтборов);
	ДополнительныеПараметры.Вставить("ИмяГруппыОтборов", ИмяГруппыОтборов);
	ДополнительныеПараметры.Вставить("ИмяПредопределенныеОтборыПоУмолчанию", ИмяПредопределенныеОтборыПоУмолчанию);
	
	РаботаСОтборамиКлиент.НастроитьОтборыНажатие(ЭтотОбъект, ПараметрыОткрытияФормыСНастройкамиОтборов(ДополнительныеПараметры), ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыОткрытияФормыСНастройкамиОтборов(ДополнительныеПараметры)
	
	Возврат РаботаСОтборами.ПараметрыДляОткрытияФормыСНастройкамиОтборов(ЭтотОбъект, ДополнительныеПараметры);
	
КонецФункции

&НаКлиенте
Процедура НастройкаОтборовЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаОтборовЗавершениеНаСервере(Результат.АдресВыбранныеОтборы, Результат.АдресУдаленныеОтборы, ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура НастройкаОтборовЗавершениеНаСервере(АдресВыбранныеОтборы, АдресУдаленныеОтборы, ДополнительныеПараметры)
	
	Если ДополнительныеПараметры = Неопределено Тогда
		ИмяРеквизитаСписка = "Список";
		ИмяТЧДанныеМеток = "ДанныеМеток";
		ИмяТЧДанныеОтборов = "ДанныеОтборов";
	Иначе
		ИмяРеквизитаСписка = ДополнительныеПараметры.ИмяРеквизитаСписка;
		ИмяТЧДанныеМеток = ДополнительныеПараметры.ИмяТЧДанныеМеток;
		ИмяТЧДанныеОтборов = ДополнительныеПараметры.ИмяТЧДанныеОтборов;
	КонецЕсли;
	
	РаботаСОтборами.НастройкаОтборовЗавершение(ЭтотОбъект, АдресВыбранныеОтборы, АдресУдаленныеОтборы, ДополнительныеПараметры);
	
КонецПроцедуры

// @skip-warning
&НаКлиенте
Процедура Подключаемый_ОтборПриИзменении(Элемент)
	
	Подключаемый_ОтборПриИзмененииНаСервере(Элемент.Имя, Элемент.Родитель.Имя)
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОтборПриИзмененииНаСервере(ЭлементИмя, ЭлементРодительИмя)
	
	РаботаСОтборами.Подключаемый_ОтборПриИзменении(ЭтотОбъект, ЭлементИмя, ЭлементРодительИмя);
	
КонецПроцедуры

// @skip-warning
&НаКлиенте
Процедура Подключаемый_ОтборОчистка(Элемент)
	
	Подключаемый_ОтборОчисткаНаСервере(Элемент.Имя, Элемент.Родитель.Имя)
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ОтборОчисткаНаСервере(ЭлементИмя, ЭлементРодительИмя)
	
	РаботаСОтборами.Подключаемый_ОтборОчистка(ЭтотОбъект, ЭлементИмя);

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьОтборов()
	
	Если НЕ ПолучитьФункциональнуюОпцию("УчетПоНесколькимСкладам") Тогда
		Элементы.ОтборСклад.Видимость = Ложь;
		Элементы.ГруппаОтборСклад.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьПоШаблону(Команда)
	
	ИсключитьТипы = Новый Массив;
	ИсключитьТипы.Добавить(Тип("ДокументСсылка.КорректировкаРеализации"));
	ИсключитьТипы.Добавить(Тип("ДокументСсылка.СчетФактура"));
	
	ЗаполнениеОбъектовУНФКлиент.ПоказатьВыборШаблонаДляСозданияДокументаИзСписка("ЖурналДокументов.ДокументыПоЗапасам",
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы, Элементы.Список.ТекущаяСтрока, ИсключитьТипы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АдаптироватьИнтерфейсПодМобильныйКлиент()
	
	Если НЕ ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Отборы.ОтображатьЗаголовок = Истина;
	Элементы.Отборы.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
	
КонецПроцедуры

#КонецОбласти
